{"podcast_details": {"podcast_title": "Mega", "episode_title": "Bonus Episode! Red Letter Day with Jenny McGrath", "episode_image": "https://megaphone.imgix.net/podcasts/b923f90a-5e70-11ea-92bd-1339c3247d16/image/New_Mega_icon.jpg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " This is a Glass Box Media Podcast. Quick announcement before we start. You know how you hear a word from our sponsors at the top of each episode or during our ad breaks? Well, these ads make our show possible. However, we are now offering an ad-free version of Mega on Mega Premium. It's so easy. Ad-free episodes and bonus episodes will just start arriving in your feed. All you have to do is go to the show notes and click on Mega Premium. For you Apple Podcast listeners, you can just hit subscribe in your podcast player. For everybody else, subscribe to Mega Premium by going to mega.supportingcast.fm Or, to make it even easier, just click the link in our show notes to sign up. You'll get early access, ad-free listening, and bonus content. If you want to try it out first, you can get one free month on Supporting Cast. Just use code MEGA. If you want to support the show, but have never been moved by the Holy Spirit to join Patreon, we've got options. And this is so easy and convenient. It's a no-brainer. Click on the link in the show notes to sign up for Mega Premium. And thanks. Go to your happy prize, price line. Between the kids being home and hosting, everything in our house gets used up in summer. With Instacart, I can save money by stocking up on all my favorite summer brands. I save time by getting everything delivered in as fast as an hour. And I save myself a sink full of dirty dishes by stocking up on paper plates for the annual Summer Cookout. Save more on summer essentials? Spend more time enjoying summer. Add Summer to Cart. Download the app to get free delivery on your first three orders. Offer valid for a limited time. Minimum $10 per order. Additional terms apply. MEGA is an improvised satire from the staff of a fictional MEGA church. We are here, Lord, we are here. And we're ready to protest. Hi, I'm Dale LaBonde and this is MEGA, a podcast that normally belongs to my mom, but I've taken it over today because, you know, there's stuff I want to talk about on here and she'll probably delete it later. Whatever. I'm very excited because I'm here to talk to Jenny McGrath, a very rad person who knows a bunch of stuff that I want to know. So hi, Jenny. Welcome to MEGA the Podcast. Hi, thank you so much for having me. Really excited to be here with you today. Oh, yeah. Awesome. Okay. I do hope my mom does not delete this later. Okay. So, um, I found Jenny on Instagram and because I was watching one of her videos where she was talking about purity culture, and I've actually been raised with this huge massive importance placed on purity. And when honestly, Jenny, when I first heard you talking about purity, you were talking about it like different than I was used to it as a subject matter and you were making points that like felt like kind of subversive to me. And like I was like, okay, let's go. So I wanted to talk to you and also share her with all of you all out there. So, okay, Jenny is a licensed mental health counselor. She's a somatic experiencing practitioner and a purity culture researcher. I'm going to ask you about some of those words later too, but it's all really cool. So Jenny, like how did you get interested in this stuff? Yeah, that's such a great question. And I really connect with what you just said about how what you heard me say is not really what you've heard a lot in perhaps church or culture at large. Because I myself grew up in purity culture. I grew up in Colorado Springs, which is sort of one of the epicenters of white evangelical Christianity. And I also grew up in the 90s. And so it was a particular height in the purity culture movement. And so I was deeply, deeply impacted by it growing up. I begged my parents for a purity ring when I turned 13 years old. Yeah. And as part of that world, you know, I really wanted to be good. And I believed that the best, goodest possible thing I could do was to become a missionary. So I actually moved to northern Uganda as a 19 year old and spent a few years there on and off. And it was really my own body that actually led me to my current profession, because after a few years there, my body sort of broke down. I got shingles and my nervous system and my immune system just kind of stopped working. And so it led me on a really long journey of researching and understanding traumas impact on the body. And so it started out with my own lens and my own experience in my body. And then for the last eight years, I've been a mental health counselor, working primarily with other white women who grew up in purity culture. And realizing time and time again, the different themes that happen for folks who are socialized into these systems, both in their personal body and in our collective bodies. Whoa, yeah. That's really cool. How were the 90s? I loved so much about the 90s. I think it was such a fun time to be alive. It's so weird to me that folks of your generation call it the 1900s, because it doesn't actually feel that long ago to me, but I'm reckoning with my age at this point. That's so cool that you lived in another century. So maybe I'll start with, I'm always banging around on this drum of the idea of consent and mostly just because my mom told me not to and because she says it's like a slippery slope and it's about self-importance. And it takes our eyes off of God's plan, basically. And I don't know, I can just tell that the very concept of consent is a threat to my biblical upbringing. I don't know, I didn't understand consent for a long time, to be honest, Jenny, because I thought it was the papers you have to sign when you go to paintball. Because one time my friend, Jean Carlo, he put a fake name on the paintball paper and he said his name was Seymour Butz and they didn't catch it at first and we started the game, but then they stopped us and they kicked us out. And now we have to do Whirlyball, which sucks. But I thought consent was like that, where you were like, it's okay if I get a concussion in paintball. But do you know what consent is and why it's important or why it's threatening? Yeah, totally. I love that story. I think that's hilarious. And, you know, that is a type of consent. What you were writing on that paper was your name and you're agreeing to do something. And so at its core, that is all consent is. It is saying, my agency, my autonomy, my individuation is online and I am choosing to say yes to this. And I'm choosing that I'm going to be responsible for whatever the consequences of this are. And so I think that consent is incredibly important because it allows us to understand our own choices and the impact that they might have. And I think some of the reasons why it can be threatening in certain Christian spaces is that there can actually be sort of this glorification of hive mind and of really just doing what other people do without really questioning, is this what I want to do? Is this something that feels good in my body? Is this something that I'm willing to pay the consequences for if I choose to do it? And I think that consent really requires us to have a good awareness of our body, which in my experience and in many people's experience who grew up in purity culture, there is actually a disembodiment and a disassociation from the body that happens. And I think part of this is actually intentional because it keeps us doing what the system might want us to do. Mina Salami says, tyrants have always understood that the more robotic people are, the more easily manipulated they are. Whoa, yeah. Yeah. Does that connect with you a little bit? Yeah, that's so cool. I'm going to say that. I'll quote it to Salami though. Yeah. And so I think that's part of consent is embodiment, is knowing our body, what we want to say yes to and what we want to say no to. And unfortunately, consent often isn't taught in abstinence only education, which leads to a lot of confusing situations for folks of all genders, whether they actually chose to engage in a sexual interaction or not. And so that can create at best confusion. And at worst, it can often lead to harm and abuse and assault. Whoa. Yeah. So, okay, you said a bunch of words that I can already tell are why my mom doesn't want me to worry about consent or even think about it or learn about it or apply it or whatever. Because basically, yeah, we're not supposed to feel our bodies because our bodies are bad and dirty and will drag us straight to hell. There's Bible verses, the spirit is willing, but the flesh is weak. And we've been taught that our spirit can be saved through the redemptive power of what Jesus did on the cross and all that stuff. But our body is a real problem. So you're basically saying that your body isn't wrong and bad and disgusting and gross and that if you listen to it, it will tell you, yes, this is good for me. No, like, I guess it's even I guess a thing where I'm like, I just don't like coconut. No offense, none taken. But I'm not going to have an almond joy if I could have a whatchamacallit or a three musketeers. So I'm like that. So like, so are you saying like, if I do it like that with candy bars, I'm like, look, I don't want to eat an almond joy because I don't like it. I'm not saying nobody can eat almond joy, but I am just not giving you consent to put an almond joy in my mouth. But you can put a three musketeers in my mouth. Is that it? Absolutely, absolutely. And consent is really connected to this other phrase that you can remember or not remember. It's not important the actual words, but it's called our hedonic tone. And our hedonic tone is our sense of what we like and what we don't like. And the more in tune with and the more robust we are in our hedonic tone, the more clear we can be to say, yes, I like this candy bar. No, I don't like hiking in the rain, whatever it might be. We get to have more of a sense of autonomy and agency over our own body. Wow. And yeah, that is definitely a threat to the idea of like, you have to be on God's plan all the time and you have to be seeking God's will. Because if I was like, well, I'm checking in with my body and I'm aware of like what feels good to me and what feels bad to me, then, you know, my mom would be like, that isn't what's important. God's will is important. So, yeah, because I do see like that. I think a lot of stuff with God in the Bible, like God doesn't really get consent because he's like, I'm God. I'll do whatever I want type of thing. Absolutely. Yeah. And that was something that was really hard and honestly still is hard. It's still something I have to kind of unconscious or very consciously unprogrammed in my own brain because it was messages I heard my entire life. And one of the things that helped me is understanding that the current idea about soul and body actually wasn't what the original writers of the Old or New Testament had in mind. It was really formulated through Plato and through the idea, it wasn't until essentially Plato that the soul was seen as separate than the body. So before then, it was the idea that my body and soul are both animated through my breath, through the breath of God, through my spirit that gives me life. And so some of this has been a journey of learning more about the history of the theologies and the doctrines and the dogmas that were taught and where they come from that has helped me have a healthier relationship to my own body. Whoa, that makes sense because like I've looked into that too, that like it was important for Jesus to be like touch the holes in my hands and see that I'm alive physically because Jesus at that time in human, whatever it's called, like humans didn't. The people who spoke Aramaic at the time Jesus was alive in the region where Jesus was alive, they had no idea of a soul, but life only existed in a alive body. So it was very important that he was like, look, my body's alive. So that makes total sense. But yeah, I guess it really benefits Christians to kind of parse it out like that, even though it doesn't even technically make sense, even based on their own text. That's interesting. Whoa. Okay. And it's also funny because I have a friend Austin at school who says that they're asexual and I'm like, how do you know if you'd never like had sex and they're like, I just don't want to and and I know that and I'm not interested in it and I'm asexual and I'm like, okay, which actually seems like that would be really great for Christian parents. If their kids told them that maybe we should all just tell them that. I'm not condoning lying, but okay. So, but I guess, I don't know, you can even be an alcoholic genetically even if you never have a sip of booze you just wouldn't know because you never got hammered or something. Maybe that doesn't make sense. But okay, I want to come back. Can we talk about purity culture, Jenny, a little more? Yeah, absolutely. Okay, so like, I've been to like purity balls for friends of mine who are girls. Have you ever been to a purity ball? I have, yes. Oh, I want to hear about yours. Okay, because for those of you out there who don't know, like it's the one I went to for my friend Madison Mackenzie was, it's a lot like a wedding, but like instead of two grownups committing their love and devotion to each other publicly, it's a teenage daughter kind of committing her virginity to her father publicly for him to be the guardian of it until the day that he hands the responsibility of that over to her husband. And like in my youth group climate. Well, first, what is the purity ball you went to like? Yeah, it was it was very similar. So as I mentioned, I grew up in Colorado Springs, which was actually the birthplace of purity balls. That's where they originated. So they were a pretty common thing when I was growing up. And they were just that it felt very much like a wedding ceremony. I think that my friend was actually wearing a wedding gown and had a dance with her father like you would on a wedding day. And yeah, it was it was not too separate from a wedding ceremony. And it was essentially her pledging, as you said, her virginity, her body to her father, who would hold her virginity for her. Yeah, I would agree. At the time, it was normal. And part of that is because of my own disembodiment and my own indoctrination into the system. But even at the time, I felt a lot of shame and disgust. But I always channeled that back at my own body. Because I didn't have I what I am not asexual. And so I had a lot of shame about desire or arousal or even crushes that I had because that felt like I wasn't doing purity, right. And so a lot of it required kind of this trying to de sexualize myself and sever myself from my own identity and orientation. Whoa, okay. Um, I really hate to do this to be but I don't know you seem like you okay, just because you brought up the idea of arousal. And I know that there is like so much shame around that, especially for youth group kids. And um, just okay, really quick, yes or no question. Is it bad and wrong to master a jerk off or whatever you call it? No. No. Okay. Whoa. Okay. Okay. So anyway, thanks for Whoa. Okay. So okay, so back to the idea that that's just for all of you listening out there. Um, yeah, I wish Jenny was my mom. I have microdosed psilocybin on and off for a few years now. That's magic mushrooms for those of you in the back. Let me dispel a few fears for you. When I take psilocybin, I can barely feel it a little lighter definitely a mood improver. But the lasting effects are the most noticeable. Thoughtfully dosed mushrooms at sub hallucinogenic levels can sharpen your focus and help you focus. Thoughtfully dosed mushrooms at sub hallucinogenic levels can sharpen your focus hone your mental clarity, unleash your creativity, expand your mind and open your heart and best of all ease your anxiety. And while I don't condone getting on the web and seeing if you can take your chances with finding a good source for micro doses from a guy called trip daddy 69 on Reddit, I do absolutely endorse heading over to schedule 35 who take a science backed approach to microdosing mushrooms. They precisely measure out every dose. They verify the age of every one of their customers and they ship it oh so discreetly. Your new microdosing regimen will allow you to enjoy the benefits of psilocybin without any of the hallucinogenic effects, just the good vibes and the improved mind and body connection. And mega is one of the lucky pods to get a macro deal. Head over to schedule 35.co and use coupon code mega to enjoy 15% off your first order. That's 15% off with code mega. At schedule 35.co do it. You're gonna love it. It's the best. Hey, if you're looking for something new and funny to listen to the comedy podcast network earwolf has been cooking up something special on the earwolf presents feed every month on earwolf presents you can listen to a brand new limited comedy series hosted by some of the funniest people out there like girl God that's April Clark and grace feud Oscar Montoya Mano Agapion Jacob Wysocki and in September the hilarious Lisa Gilroy you'll find series such as the girl God experience. That's where April Clark and grace feud finally asked the tough questions and blow your woke mind the try gaze. That's where Mano Agapion and Oscar Montoya learn about straight things from people like Paul F Tompkins and John Gabris Expo expose. That's where Jacob Wysocki takes listeners around to various out there conferences and conventions and coming in September Lisa Gilroy brings you the story of the forever missing boy the disappearance of Dickie Donnelly. All these series are weird experimental just plain fun and hilarious so go listen to these shows and more on earwolf presents wherever you get your podcasts. Okay so in my youth group climax we do a lot of activities around like purity culture like we give each other promise rings. Sometimes that feels like a popularity thing but like we chew up sticks of gum to represent what having sex does to your human value and we like pluck chickens to see how they're beautiful and feathery in their virginity and then they become these sad wet naked disasters like that is what happens if you have sex too. And like sometimes we cut out paper hearts and then we rip them to shreds to represent the deep destruction that's caused by sexuality but like you're the purity culture researcher so like what is purity culture like is it something that only Christians do and perpetuate and everything and like how do you know if you come from a purity culture. Yeah well first a very short answer what you just described is definitely a purity culture it's very safe to say that you are immersed in a purity culture. And you know one of the things I'll say before I answer the question about purity culture that that could be a shock but I think that's really important to understand is that virginity is a social construct. Whoa. It actually has no biological meaning to it other than the meaning we ascribe to it. Oh my mom is gonna hate this. And I you know I'm aware I am a grown woman talking to you so I won't necessarily get into the nitty gritty if that feels uncomfortable although I'm happy to explain that just more from more of an anatomical stance because I think that understanding anatomy and biology helps dispel a lot of the myths around purity culture. Okay yeah. But also, you know as we're talking about consent would love to check in with you and see how that feels and if that feels comfortable. Wow thank you so much for asking. Yeah I like of course anything having to do with a human body. I always feel like I'm not allowed to be talking about it so I'm overcoming that, but I did like as soon as you described it in like educational terms and like I'm gonna hang on to that phrase virginity is a social construct because mostly it's going to drive my mom crazy. That's good but also, yeah, I'm totally comfortable with you explaining why that's the case anatomically. Okay, yeah. And if at any point that shifts feel free to let me know. Okay, but I think it's important to understand what I will say is there are many different types of purity culture. So when I'm talking about purity culture. I am talking about a specific movement that started a little bit before the 90s because abstinence only education was infused into schools during the Reagan administration, but it really took off in the 1990s, particularly in 1993. There was this huge giant rally called true love weights, where hundreds of thousands of adolescents wrote cards that were their virginity pledges, and they pledged them on a lawn of a mall. And it was this huge statement and then after that, there were so many books that were written like I Kissed Dating Goodbye or various things that perpetuated this idea of maintaining, quote unquote, purity, which meant virginity until marriage. But again, because virginity is a social construct, this purity comes with a lot of expectations and assumptions and binary thinking. It assumes that there is only men or only male and only female or those socialized as men or socialized as women. And it is a very heteronormative concept that says virginity is only lost when someone with a male body penetrates someone with a female body. But there are many different types and ways that people of all genders and all sexes have intimacy with one another. But a lot of the idea of losing virginity comes from a long, long history of patriarchy and control over women's bodies, based on a myth that the hymen is this organ that somehow pops or bursts or opens when a female body has sex for the first time. But all the hymen is, when someone is in a female body and they're in utero, their vagina is a solid tube. And then as they develop, that tube gets bigger and bigger. And sometimes there's a little bit of tissue left. Sometimes it's almost like a croissant shape. Sometimes it covers the whole opening, but it's different for everybody. And sometimes it can be impacted from riding a bike. Sometimes it can be impacted by sex, sometimes not. And so it's all essentially based on this idea of quote unquote protecting, but really controlling primarily white female bodies in this system. But that control also disproportionately impacts bodies that aren't white or straight or cisgender or able-bodied or this kind of epitome of what a pure body looks like. How does it affect those other bodies that aren't like white ladies? Yeah, in many different ways. One that comes to mind is that through the idea of abstinence only education, a lot of times there is a war against providing contraceptives and birth control and abortion care. And due to the economic disparities in our country, black and brown bodies are disproportionately impacted by not having access to contraceptives or abortion care. And so there becomes more and more of a disparity in economics based on whose bodies get to be quote unquote pure and whose don't. And often LGBTQ bodies are left out of the conversation altogether or they are assigned as hyper sinful and there's something extra wrong with them because they don't fit into this heteronormative cisgender structure. And so that can really impact both through an internalized sense of shame, but also through an external oppression and hatred and harm that comes against bodies of color and the LGBTQ community. That sucks. Yeah, it's pretty devastating. That really sucks. And so it's like a big part of that like preserving white, pure women. Is one of the impacts of that? They're saying that women of color, that their bodies aren't like even like part of the purity culture. They're not even, they don't care to like try to protect that or keep that quote unquote pure or whatever. Yeah, absolutely. And that doesn't mean that, you know, women of color or people in a female body that are people of color didn't experience purity culture because they certainly did. And there's many variations of purity culture. And to go back to your question, you know, we're seeing in Iran right now, the movement of women life freedom is fighting against the Islamic form of purity culture that's taken over the government there. So there's so many different nuances and complexities, but in the United States, the white evangelical Christian purity culture structure prioritizes, well it prioritizes white cis male bodies, but then it also prioritizes white cis female bodies in proximity to white male bodies. So power and privilege are given in how close or far away they are from the white straight cis male body. Man, patriarchy, huh? Yeah, it's rough. And that's why it makes me so encouraged that someone your age and of your gender is asking such really important questions. Oh, thank you. That's cool. Well, I honestly, there are a few questions I have for you today that come from how unsatisfying a lot of the answers I've gotten at church are. And, yeah. So, because I go to a public school but, um, I don't know like speaking of education, like, okay, I was going to tell you that one time they separated us by gender in our health class. And, um, and then my teacher Mr. Boggs he drew these fallopian tubes on the board, and was like doing this whole thing but my friend Brooklyn he started laughing so hard that he farted and then we all were laughing he got a detention and we couldn't tell Mr. Boggs, it was more that it sounded like that, um, that my friend Brooklyn like gambled on a fart and lost we thought he like filled his pants and with it, but he got a detention and then my mom and then we didn't get to finish with the tubes and everything and my mom was, she was so disgusted that I got in there to note that I wasn't allowed to go to health class on the sex ed days and but then I never turned it in but um I guess my question is, is it okay for like junior high age and high school age kids to know, like the anatomy of their own body and the bodies of others. Is it okay to know that stuff. I absolutely think it's not only okay, I think it's really important that we understand the diversity of bodies and especially our own body. And the anger and the hatred towards bodies, specifically when we're talking about reproductive organs or genitalia, is a symptom of purity culture. We don't come into the world afraid to learn about our bodies. We're touching our bodies, we're touching other people's bodies, circling back to consent. Of course, as we get older, we learn to ask people if it's okay if we touch their body or engage their body. But we don't come into this world with a lot of shame or hesitation to explore our body. That's something that we learn. Yeah, we used to play in the hose naked in the front yard. Right, right. Exactly. It's such a human and just, you know, it's well, yeah. I could go on a tangent about it, that how much we've been socialized into shaming our bodies that is part of a history of colonialism and white supremacy where there are humans today in various parts of the world that are okay showing their bodies. And often that was actually used as justification for colonialism was these people are hypersexual or these people have diverse genders or these people have polyamorous relationships. So we need to quote unquote, Christianize them, which often meant slapping on some clothes and gender binary and really heteronormative ways of engaging the world. Whoa, that's so fascinating. And I never did think about it, but like one of my earliest memories is that like my little swimmer's diaper got too heavy and my mom took it off of me and I just kept playing and I didn't care. In fact, it felt good to lose the little swimmers. And yeah, now I would never, I would like die. I like have bad dreams about like not having myself totally covered all the time. Right. It's so normal and it's so common, especially when we live in a culture where everyone else is doing that, then we feel like we have to or we should do that. But the other thing I would say too about what you shared is that, you know, it's concerning to me that you were separated by gender because that then perpetuates this false myth that gender and even sex are binary. And there is many ways that someone may relate to their gender and it's not the same as sex. And even in sex, we have roughly as many intersex bodies in the world as there are bodies with red hair. And so that's to say there are a lot of bodies that have some variation of a penis and a vagina or a penis and breasts or different hormonal differences and variations. So there's no real binary when it comes to sex or gender. There's an incredibly beautiful spectrum in between. Wow. That is so cool. But like, okay, but my mom would say that like, if I am comfortable with my body and I understand its physiology or whatever, I'm not more apt than to get out there with this body and like take it for a ride. You know what I mean? Like, you know, like once I know how to play Minecraft, I'm going to play it right. And that's what my mom says is like, if you know about your body, then you'll use it. And that's like the worst thing you can do. Well, I guess if you are coming from an ideology that says that that's the worst thing you can do, that might be true. But if you get to come from a mindset that having sex or exploring intimacy is just like playing Minecraft, then it doesn't actually become something bad or scary. And this is why it's important, I think, to learn about your body and anatomy because you might need, you know, certain things to protect yourself and you might need certain things to protect your partners. But that doesn't mean that getting out and exploring your body is bad or dangerous. It might be bad and dangerous to a system that wants you to be robotic and disembodied. But it doesn't mean that it's actually bad. And as you mentioned, your friend earlier, who's asexual, just because someone's in their body doesn't mean they're going to want to have sex. Somebody might really be in their body, but they might not have a desire or an arousal for sex. And of course, asexual people can have sex as well, but it doesn't mean that everybody wants to. It's just listening to your own body and your own hedonic tone to say, I like this, I don't like that, I'm curious about this, I'd never want to do that. It can grow your sense of agency and empowerment in your body. Whoa, I have, I know I have a trans friend named Zach and I have a non-binary friend named May. And it's interesting because most of the time my mom doesn't pick up on it. But if she does notice they, them pronouns, she just switches it back to binary pronouns. And she's like, I won't do that day. And so, but I don't know. I kind of feel like that's like dehumanizing them because she's not even recognizing their humanity. Yeah, that makes me really sad to hear about. And unfortunately, that's really, really common, especially in this country, that there is a dehumanizing of transgender folks and non-binary folks and gender fluid folks. Because the system that we live in thrives off of believing that there is a gender binary. Capitalism doesn't exactly work if we don't have a gender binary. Capitalism doesn't work if we don't have a gender binary? Oh, that'd be great because I would love to get rid of capitalism. Absolutely. I mean, especially, you know, in the huge exponential growth of capitalism post-World War II happened because quote unquote women stayed at home with the kids and quote unquote men went to work. And so our entire labor force, and of course, this is primarily white women and white men that the capitalistic system preferences to say, you know, we are going to make women do free labor and we're not going to compensate them. And then we're going to have men go to work and get the quote unquote real job. And so we don't have a system that enables bodies of all gender to explore what type of work, what type of freedom, what type of expression they might want to have. It's so much harder because our country really thrives off of the legalization of certain types of marriage and certain types of bodies. Yeah, man. You have really pretty hands. Oh, thank you. The other night we ordered some Thai food and after getting a couple of entrees and an appetizer plus the delivery fee plus the tip, I was like, damn y'all, this is feeling like a car payment, less like a meal. It's tough to break expensive takeout habits, especially when you're short on time and fighting the hunger pangs. But Home Chef brings quick and simple home cooked meals to your dinner routine. Convenience is the core of the Home Chef recipes. Each weekly menu rotates more than 15 oven ready and fast and fresh meals that cook in the oven or microwave so you can have a fresh flavorful meal with minimal steps. After you're done, just toss the tin for an easy cleanup. Home Chef caters to a variety of dietary needs, calorie conscious, carb conscious, vegetarian, keto and Home Chef's new family menu solves family dinner every night of the week too. Starting at just 377 per meal, these easy four serving recipes are full of family friendly flavors that will satisfy even the pickiest eater. Family friendly flavors. Say that three times fast. For a limited time, new customers can go to homechef.com slash mega and get this, get 18 free meals. 18 free meals. What is this? Home Chef in heaven. Again, go to homechef.com slash mega for 18 free meals. Thanks Home Chef. Okay. So speaking of trying to control people, um, some people or some groups or whatever nowadays are like banning books and threatening librarians and bookstores. Have you heard about this? I have. Yeah. I would say that like any adult who shares, even if it's like factual or educational information with adolescents, like they'll be punished and stuff. And like, I don't know, I feel like when I was younger and I was learning about like Stalin burning books and fascist leaders and before that was like all the scary times that like now we're more modern or whatever. So it's sort of weird that that's back because I even remember in church, I grew up believing that like banning books is a sign of authoritarian regimes. And it's like we're, we're two stuff, you know? And like we, we learned from that. We knew those were the bad guys and we were trying to be the good guys. But now it feels like people are like, even the church used to say, like, we, we don't need to burn books because if the Bible is true, truth stands the test of time. And so we have confidence enough in the Bible that we don't have to burn books. At least that's kind of what I thought. And now it feels like people are forgetting history and like doomed to repeat it. And also I do just also want to say, and maybe this doesn't help me at all, but like to all these people trying to ban books, don't they know that porn is online now and extremely easy to access, especially for those of us who have grown up with screens and we're like much smarter with technology than our parents. Because like, Oh my gosh, Jenny, I mean, one time my mom found a VHS tape of strip tease on top of the entertainment system and I got in so much trouble. And I was like, I don't watch VHS tapes. I don't even have, I don't. And, and, and, and I was like, that's dad's. And I think my dad had rented strip tease and, and he told, and he said to my, he told my mom that I got it with my library card. And I'm like, I don't even go in the library. I only skateboard outside the library. But anyway, I was falsely accused. I'm sorry. But the question is like, is it okay for responsible adults to have like, you know, open conversations with young people or should we like restrict information for those people's safety? Yeah. I think it is so important to have accurate information about bodies, about history, about gender, about sexuality. And I think you're actually, you're absolutely right. You know, it, it, it terrifies me to see what's happening right now in our country with burn bans or book bans. And you know, honestly, what comes to mind is that this also happened during the Nazi regime where the Sexology Institute was looted. And it was known as an institute that was for transgender folks, for gay folks. It was doing so much good to research and provide care for the queer community. And it was looted and burned. And what was really tragic and also powerful is that in one of the books, the author had written where they burn books in the end, they will burn humans too. Whoa. And it was, it was a foreshadowing of what happened. You know, the concentration camps included homosexual people that were rounded up and sent there because of their identity and because of their orientation. And I think that tyrants and systems of power thrive off of miseducation and undereducation. And you know, this isn't exactly related to now, but what honestly comes to mind is that this has been going on not only since World War II, but this went on with what we now know of as the New Testament. Because until the year 467, there were many other books that were gospels, that were epistles, that were letters. And there was one man named Athanasius who came up with the 27 books that are now in the New Testament and decried that all of the rest of them were inappropriate and should be burned and destroyed. And we see what that led to in the way in which there's been a dogma formed around certain types of literature that was let in to the New Testament. And so this is a pattern of history for a very, very, very long time to try to stifle different ways of thinking, to stifle feminist ways of thinking, to stifle queer ways of thinking that don't function in this dogmatic, binary, all or nothing, spirit or flesh, good or bad way. Yeah, like Jenny, are you familiar with the Gospel of Thomas? This is something that I've been learning about lately because it didn't make it in the canon of the Bible. Yeah, I am a little bit. Do you know about how it ends? Yeah, it's pretty fascinating. All right, friends, that concludes the free portion of our conversation. In just a moment, I will tell you how to listen to the rest of our conversation because baby, we're just getting into it. First, I want to thank and plug my dear friend who I deeply admire, Jenny McGrath. Thank you so much for coming on the program. It was lovely to talk to you. And I do hope that you listen to the rest of the conversation, dear listener. Before I explain how to do that, though, I really want to recommend you following Jenny at indwell underscore movement or go to her website indwellcounseling.com. That's I-N-D-W-E-L-L counseling.com. She has an online movement studio if you're getting into your body. She also has a 12 week online class that I took last year called embodied sexuality. I could not recommend it more highly. Completely changed me, educated my ass. And yeah, just do it. It's an important thing in your healing journey. Does it sound interesting to you? Okay. Well, you can find all that at her website. Thanks, Jenny. And stick around because I'm about to explain to you how to listen to the rest of our conversation. Ready go. If you want the rest of this episode and lots more bonus content ad free, the best way is to join our Patreon or Apple premium. You'll get perks like behind the scenes pods, voicemails from Gray and Hallie, and you'll join a community. These bonus episodes that we make for you, we will be bringing you things like De La Bont hijacking the feed with his insights and interviews or our favorite return guests. And we'll even share live shows with you and more. And I know you hear this stuff all the time, like, Hey, for the price of a cup of coffee, it could really make a huge difference for us in our ability to keep bringing you laughs. But it's really true. And hey, it's me, Holly. I'm personally asking you to support the arts and bolster the thing that you love that brings you joy. If we had 1% of our listeners support us, it would be an absolute dream come true. So give it a try and become a supporter on Patreon or Apple premium or supporting cast any which way you want to do it. All the links are in the show notes and thanks for considering it. And thanks again for listening to mega because I really value truth misinformation really, really scares me. And that's why I'm excited to tell you about Conspiratuality, a podcast that dismantles new age cults, wellness grifters and conspiracy mad yogis at their best. They attack public health efforts in times of crisis. And at their worst, it's like they're recruiting for the fever dream of QAnon on Conspiratuality. You will have a journalist, a cult researcher and a philosophical skeptic all discussing stories and cult dynamics and helping educate us and using proven science as their guiding light. I really recommend the Jordan Klepper episode talking about creating comedy in the mega verse. Jordan's incredible. And I also really love the medical medium episode. It's really good. And not just because I've had my own weird experiences with mediums from exploring cults to analyzing our cultural and political landscape. The Conspiratuality podcast will help you stay informed against misinformation and resist fear tactics. Find Conspiratuality on Apple podcasts, Spotify or wherever you get your podcasts. When you listen to Nobody listens to Paula Poundstone, the comedy podcast, you learn stuff. I've been learning to throw a boomerang because this is the kind of thing that really gets the listeners engaged. Interviews with people who will make you smarter. Is the amount that you learn protect you from cognitive decline? Can't people just listen to the show? Can't they just enjoy a delightful tree house full of information and I think I'm bleeding. Join us and be a nobody. This is a Glassbox Media Podcast."}, "podcast_summary": "In this podcast episode, Dale LaBond interviews Jenny McGrath, a licensed mental health counselor and purity culture researcher. Jenny shares her personal experience growing up in purity culture and the detrimental impact it had on her relationship with her body. She discusses the importance of consent, understanding our own desires and boundaries, and debunking myths about virginity. Jenny also highlights the harmful effects of purity culture on marginalized communities, such as people of color and the LGBTQ+ community. The conversation touches on the history of book banning and how knowledge suppression is a tactic used by authoritarian regimes. Finally, they emphasize the importance of educating young people about their bodies and providing accurate information about anatomy, gender, and sexuality.", "podcast_guest": "There was no guest information found", "podcast_highlights": "- Highlight 1 of the podcast: \"Consent is incredibly important because it allows us to understand our own choices and the impact that they might have.\"\n- Highlight 2 of the podcast: \"Virginity is a social construct. It actually has no biological meaning to it other than the meaning we ascribe to it.\"\n- Highlight 3 of the podcast: \"There is no real binary when it comes to sex or gender. There's an incredibly beautiful spectrum in between.\""}